# Medical Dataset Analysis: Python, SQL, and Insights
Step into the world of data-driven healthcare analysis alongside Sarah, the healthcare data explorer, in our project, "Medical Dataset Analysis: Python, SQL, and Insights." With Python as her trusted tool and SQL as her analytical compass, Sarah embarks on a mission to unlock the potential hidden in interconnected medical datasets.

This project focuses on three critical datasets: "hospitalization_details," "medical_examinations," and "names." Divided into two essential modules, the project commences with meticulous data cleaning, ensuring the data's accuracy and structure. Once the data shines brilliantly, the second module unleashes the power of SQL queries to extract valuable insights.

Our journey is a deep dive into healthcare data, unearthing insights that can revolutionize healthcare decision-making and resource optimization. It's not just data analysis; it's a transformative voyage into the world of medical dataset analysis.

By the end of this project, you won't just crunch numbers; you'll possess the tools to drive data-powered improvements in healthcare, enhancing the lives of patients and streamlining resource allocation.

Join Sarah on this captivating journey, where every line of code and every SQL query unravels the mysteries of medical data. Together, we'll illuminate the path to actionable insights, shaping the future of healthcare with data-driven solutions.

## Task 1: Loading Hospitalization Details
In this task, we load the hospitalization details from the 'hospitalisation_details.csv' file into a Pandas DataFrame named 'hosp_details.' This step is essential for our new project, "Medical Dataset Analysis: Python, SQL, and Insights," as it forms the foundation for the data analysis and insights that we aim to derive from the medical dataset.

In [62]:
#--- Import Pandas ---
import pandas as pd
#--- Read in dataset(hospitalisation_details.csv) ----
hosp_details = pd.read_csv("hospitalisation_details.csv")

#--- Inspect data ---
hosp_details

,c_id,yr,mth,date?,children?,charges?,host_tier,Ct_tier,st_id,Has_Children,Is_Frequent_Treatment
0,Id2335,1992,Jul,9,0,563.84,tier - 2,tier - 3,R1013,no,no
1,Id2334,1992,Nov,30,0,570.62,tier - 2,tier - 1,R1013,no,no
2,Id2333,1993,NaN,30,0,600.00,tier - 2,tier - 1,R1013,no,no
3,Id2332,1992,Sep,13,0,604.54,tier - 3,tier - 3,R1013,no,no
4,Id2331,1998,Jul,27,0,637.26,tier - 3,tier - 3,R1013,no,no
...,...,...,...,...,...,...,...,...,...,...,...
2427,Id2169,1999,Oct,1,0,1826.84,tier - 3,tier - 2,R1011,no,no
2428,Id2168,2003,Aug,11,1,1832.09,tier - 3,tier - 3,R1011,yes,no
2429,Id2167,2003,Aug,4,1,1837.24,tier - 3,tier - 2,R1011,yes,no
2430,Id2166,1999,Dec,12,0,1837.28,tier - 3,tier - 2,R1013,no,no
2431,Id2165,2003,Jul,20,1,1842.52,tier - 3,tier - 2,R1011,yes,no

## Task 2: Identifying Null Values in Hospitalization DetailsÂ¶
In this task, we identify and count the null values in the 'hosp_details' dataset. This step is crucial for our new project, "Medical Dataset Analysis: Python, SQL, and Insights," as it helps us understand the extent of missing data within the dataset. Recognizing and handling null values is essential for ensuring the accuracy and quality of our data analysis and insights

In [63]:
null_values = hosp_details.isnull().sum()

#--- Inspect data ---
null_values

c_id                     0
yr                       0
mth                      1
date?                    0
children?                0
charges?                 0
host_tier                0
Ct_tier                  0
st_id                    0
Has_Children             0
Is_Frequent_Treatment    0
dtype: int64

## Task 3: Identifying Data Types in Hospitalization Details
In this task, we determine the data types of the columns in the 'hosp_details' dataset. This step is vital for our data analysis, as it provides insights into how the data is stored and helps us select appropriate methods for further analysis. Understanding the data types is crucial for working with the dataset effectively.

In [64]:
datatype = hosp_details.dtypes

#--- Inspect data ---
datatype

c_id                      object
yr                         int64
mth                       object
date?                      int64
children?                  int64
charges?                 float64
host_tier                 object
Ct_tier                   object
st_id                     object
Has_Children              object
Is_Frequent_Treatment     object
dtype: object

## Task 4: Identifying Duplicate Data in Hospitalization Details
In this task, we aim to identify and quantify the presence of duplicate data within the 'hosp_details' dataset. The count of duplicates (referred to as 'duplicates' in the code) is an important metric. It helps us understand the extent of redundancy in the dataset, which is crucial for data quality and accuracy in our analysis. By recognizing and handling duplicate records, we ensure that our insights and conclusions are based on unique, meaningful data, preventing any potential distortions caused by repeated entries.

In [65]:
duplicates = hosp_details.duplicated().sum()
duplicates

#--- Inspect data ---

89

## Task 5: Data Preprocessing and Cleaning for Hospitalization Details
In this task, we perform data preprocessing and cleaning on the 'hosp_details' dataset. We start by removing duplicate records to ensure data quality and accuracy. Next, we remove specific columns, 'Has_Children' and 'Is_Frequent_Treatment,' as they are not relevant to our analysis. We also rename columns to improve clarity and understanding of the data. Finally, we save the cleaned dataset as 'hospitalisation_details_cleaned.csv.' This data preprocessing and cleaning is crucial for our analysis, as it ensures that we work with accurate and meaningful data in our new project.

In [66]:
# removing duplicates
hosp_details.drop_duplicates(inplace=True)
columns_to_remove = ["Has_Children","Is_Frequent_Treatment"]

hosp_details.drop(columns= columns_to_remove,inplace = True)

new_columns = {
    'c_id' : "customer_id",
    "yr" : "year",
    "mth":"month",
    "date?":"date",
    "children?":"children",
    "charges?":"charges",
    "host_tier":"hospital tier",
    "Ct_tier":"city_tier",
    "st_id":"street_id"
}

hosp_details.rename(columns = new_columns,inplace=True)
#--- Export the df as "hospitalisation_details_cleaned.csv" ---

hosp_details.to_csv("./hospitalisation_details_cleaned.csv",index=False)

#--- Inspect data ---
hosp_details

,customer_id,year,month,date,children,charges,hospital tier,city_tier,street_id
0,Id2335,1992,Jul,9,0,563.84,tier - 2,tier - 3,R1013
1,Id2334,1992,Nov,30,0,570.62,tier - 2,tier - 1,R1013
2,Id2333,1993,NaN,30,0,600.00,tier - 2,tier - 1,R1013
3,Id2332,1992,Sep,13,0,604.54,tier - 3,tier - 3,R1013
4,Id2331,1998,Jul,27,0,637.26,tier - 3,tier - 3,R1013
...,...,...,...,...,...,...,...,...,...
2338,Id5,1989,Jun,19,0,55135.40,tier - 1,tier - 2,R1012
2339,Id4,1991,Jun,6,1,58571.07,tier - 1,tier - 3,R1024
2340,Id3,1970,Jun,11,3,60021.40,tier - 1,tier - 1,R1012
2341,Id2,1977,Jun,8,0,62592.87,tier - 2,tier - 3,R1013
2342,Id1,1968,Oct,12,0,63770.43,tier - 1,tier - 3,R1013

## Task 6: Loading Medical Examination Data
In this task, we load the medical examination data from the 'medical_examinations.csv' file into a Pandas DataFrame named 'med_exam.' This step is essential for our new project, "Medical Dataset Analysis: Python, SQL, and Insights," as it forms the foundation for the data analysis and insights that we aim to derive from the medical dataset.

In [92]:
#--- Read in dataset (medical_examinations.csv) ----
med_exam = pd.read_csv("medical_examinations.csv")

#--- Inspect data ---
med_exam

,cid,b_m_i,HBA1C,h_Issues,any_transplant,cancer_hist,noofmajorsurgeries,smoker??,recovery_period
0,Id1,47.410,7.47,No,No,No,No major surgery,yes,NaN
1,Id2,30.360,5.77,No,No,No,No major surgery,yes,NaN
2,Id3,34.485,11.87,yes,No,No,2,yes,Moderate
3,Id4,38.095,6.05,No,No,No,No major surgery,yes,NaN
4,Id5,35.530,5.45,No,No,No,No major surgery,yes,NaN
...,...,...,...,...,...,...,...,...,...
2369,Id128,32.775,4.72,No,No,No,No major surgery,yes,NaN
2370,Id129,34.200,5.91,yes,No,No,No major surgery,yes,NaN
2371,Id130,30.200,9.58,No,No,No,No major surgery,yes,NaN
2372,Id131,48.320,5.77,No,No,No,No major surgery,yes,NaN
2373,Id132,44.860,4.38,yes,No,No,No major surgery,yes,NaN

## Task 7: Identifying Null Values in Medical Examination Data
In this task, we identify and count the null values in the 'med_exam' dataset. This step is crucial for our new project, as it helps us understand the extent of missing data within the dataset. Recognizing and handling null values is essential for ensuring the accuracy and quality of our data analysis and insights.

In [93]:
null_values = med_exam.isnull().sum()

# --- Inspect data ---
null_values

cid                      0
b_m_i                    0
HBA1C                    0
h_Issues                 0
any_transplant           0
cancer_hist              0
noofmajorsurgeries       0
smoker??                 0
recovery_period       1096
dtype: int64

## Task 8: Identifying Data Types in Medical Examination Data
In this task, we determine the data types of the columns in the 'med_exam' dataset. This step is vital for our data analysis, as it provides insights into how the data is stored and helps us select appropriate methods for further analysis. Understanding the data types is crucial for working with the dataset effectively.

In [94]:
datatype = med_exam.dtypes

#--- Inspect data ---
datatype

cid                    object
b_m_i                 float64
HBA1C                 float64
h_Issues               object
any_transplant         object
cancer_hist            object
noofmajorsurgeries     object
smoker??               object
recovery_period        object
dtype: object

## Identifying Duplicate Data in Medical Examination Data
In this task, we aim to identify and quantify the presence of duplicate data within the 'med_exam' dataset. The count of duplicates (referred to as 'duplicates' in the code) is an important metric. It helps us understand the extent of redundancy in the dataset, which is crucial for data quality and accuracy in our analysis. By recognizing and handling duplicate records, we ensure that our insights and conclusions are based on unique, meaningful data, preventing any potential distortions caused by repeated entries.

In [78]:
duplicates = med_exam.duplicated().sum()

#--- Inspect data ---
duplicates

39

## Task 10: Data Preprocessing and Cleaning for Medical Examination Data
In this task, we perform data preprocessing and cleaning on the 'med_exam' dataset. We start by removing duplicate records to ensure data quality and accuracy. Next, we remove a specific column, 'recovery_period,' as it may not be relevant to our analysis. We also rename columns to improve clarity and understanding of the data. Finally, we save the cleaned dataset as 'medical_examinations_cleaned.csv.' This data preprocessing and cleaning is crucial for our analysis, as it ensures that we work with accurate and meaningful data in our new project.

In [79]:
med_exam.drop_duplicates(inplace=True)

columns_to_be_removed = ["recovery_period"]
med_exam.drop(columns=columns_to_be_removed,inplace=True)

new_column_name = {
    
    "cid":"customer_id",
    "b_m_i":"BMI",
    "h_Issues":"health_issues",
    "noofmajorsurgeries":"number_of_major_surgeries",
    "smoker??":"smoker"
}

med_exam.rename(columns=new_column_name,inplace=True)
#--- Export the df as "medical_examinations_cleaned.csv" ---

med_exam.to_csv("medical_examinations_cleaned.csv",index=False)

#--- Inspect data ---
med_exam

,customer_id,BMI,HBA1C,health_issues,any_transplant,cancer_hist,number_of_major_surgeries,smoker
0,Id1,47.410,7.47,No,No,No,No major surgery,yes
1,Id2,30.360,5.77,No,No,No,No major surgery,yes
2,Id3,34.485,11.87,yes,No,No,2,yes
3,Id4,38.095,6.05,No,No,No,No major surgery,yes
4,Id5,35.530,5.45,No,No,No,No major surgery,yes
...,...,...,...,...,...,...,...,...
2330,Id2331,22.340,5.57,No,No,No,1,No
2331,Id2332,17.700,6.28,No,No,No,1,No
2332,Id2333,16.470,6.35,No,No,Yes,1,No
2333,Id2334,17.600,4.39,No,No,No,1,No
2334,Id2335,17.580,4.51,No,No,No,1,No

## Trend Analysis
### Task 1: Data Download, Import, and Database Connection

In [80]:
# -- Load the sql extention ----
%load_ext sql

# --- Load your mysql db using credentials from the "DB" area ---
%sql mysql+pymysql://root:password@localhost/hospital_data

There's a new jupysql version available (0.10.7), you're running 0.10.3. To upgrade: pip install jupysql --upgrade

Connecting to 'mysql+pymysql://root:***@localhost/hospital_data'

## Task 2: Average Hospital Charges Analysis
In this project, we aim to analyze a medical dataset to determine the average hospital charges. This analysis can provide essential insights into healthcare cost trends, helping hospitals and patients understand the financial aspects of medical care. By calculating the average hospital charges, we gain valuable information for financial planning, cost optimization, and transparency in healthcare services.

In [83]:
%%sql
select round(avg(charges),2) as Avg_of_charges from hospitalisation_details

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

1 rows affected.

+----------------+
| Avg_of_charges |
+----------------+
|    13559.07    |
+----------------+

## Task 3: High Charges Analysis
This project focuses on identifying unique customer identifiers, corresponding years, and charges from a specific medical dataset, specifically for records where charges exceed 700. By retrieving this data, we can gain insights into cases of exceptionally high hospital charges, which can inform further investigation, cost control strategies, and patient financial support.

In [86]:
%%sql
select customer_id,year,charges
from hospitalisation_details
where charges >700

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

2331 rows affected.

+-------------+------+---------+
| customer_id | year | charges |
+-------------+------+---------+
|    Id2323   | 1999 |  722.99 |
|    Id2322   | 2002 |  750.0  |
|    Id2321   | 1993 |  760.0  |
|    Id2320   | 1996 |  760.0  |
|    Id2319   | 1993 |  770.0  |
|    Id2318   | 1996 |  770.38 |
|    Id2317   | 1995 |  773.54 |
|    Id2316   | 2004 |  830.52 |
|    Id2315   | 2000 |  865.41 |
|    Id2314   | 1993 |  896.21 |
+-------------+------+---------+
Truncated to displaylimit of 10.

## Task 4: High BMI Patients Analysis
In this project, we aim to retrieve the name, year, and charges for customers with a BMI (Body Mass Index) greater than 35 from a medical dataset. Analyzing the data of high BMI patients allows us to understand the healthcare costs associated with this specific group. This information can be valuable for identifying health trends, managing patient care, and optimizing medical expenses.

In [91]:
%%sql
select n.name,year,charges 
from hospitalisation_details as hd
inner join names as n
on hd.customer_id = n.customer_id
limit 5

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

5 rows affected.

+------------------------------------+------+---------+
|                name                | year | charges |
+------------------------------------+------+---------+
|        German, Mr.  Aaron K        | 1992 |  563.84 |
|       Rosendahl, Mr.  Evan P       | 1992 |  570.62 |
|         Albano, Ms.  Julie         | 1993 |  600.0  |
| Riveros Gonzalez, Mr.  Juan D. Sr. | 1992 |  604.54 |
|       Brietzke, Mr.  Jordan        | 1998 |  637.26 |
+------------------------------------+------+---------+

## Task 5: Customers with Major Surgeries
This project focuses on listing customer IDs and names of individuals from the names table who have undergone major surgeries, as recorded in the medical_examinations table. By identifying such patients, we can gain insights into the population with a history of major surgical procedures, which can inform healthcare planning, risk assessment, and medical follow-up.

In [99]:
%%sql
select n.customer_id , n.name
from names as n
inner join medical_examinations as me
on n.customer_id = me.customer_id
where me.number_of_major_surgeries >= 1

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

1261 rows affected.

+-------------+----------------------------------+
| customer_id |               name               |
+-------------+----------------------------------+
|     Id3     |          Lu, Mr.  Phil           |
|     Id8     |      Hallman, Mr.  Stephen       |
|     Id9     |      Moran, Mr.  Patrick R.      |
|     Id11    | Fierro Vargas, Ms.  Paola Andrea |
|     Id15    |      Rios, Ms.  Leilani M.       |
|     Id17    |     Cronin, Ms.  Jennifer A.     |
|     Id18    |   Noordstar, Ms.  Christina M.   |
|     Id19    |     Boudalia, Mr.  Said Sr.      |
|     Id21    |        Fennon, Mr.  Myles        |
|     Id22    |      Hribar, Ms.  Madelyn C      |
+-------------+----------------------------------+
Truncated to displaylimit of 10.

## Task 6: Average Charges by Hospital Tier in 2000
In this project, we aim to calculate the average hospital charges per hospital tier for the year 2000 from the hospitalization_details table. This analysis allows us to understand the variation in charges based on the hospital tier, providing insights into cost disparities and healthcare quality across different tiers. It can assist in making informed decisions about healthcare facilities and costs.

In [101]:
%%sql
select avg(charges)
from hospitalisation_details as hd 
where year = 2000
group by `hospital tier`

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

3 rows affected.

+-------------------+
|    avg(charges)   |
+-------------------+
| 4673.116666666667 |
| 8915.937027027028 |
|     35367.4375    |
+-------------------+

## Task 7: Smoking Patients with Transplants Analysis
This project aims to retrieve customer IDs, BMI, and charges for patients who are smokers and have undergone a transplant, as per the medical_examinations and hospitalization_details tables. Analyzing this data allows us to study the healthcare costs and health conditions of patients with a history of smoking and transplants. This information can be valuable for targeted healthcare interventions and cost estimation.

In [102]:
%%sql
select hd.customer_id,BMI,charges
from hospitalisation_details as hd
inner join medical_examinations as me
where smoker = "yes" and
any_transplant = "yes"

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

58575 rows affected.

+-------------+--------+---------+
| customer_id |  BMI   | charges |
+-------------+--------+---------+
|    Id2335   | 17.29  |  563.84 |
|    Id2335   | 21.565 |  563.84 |
|    Id2335   | 21.66  |  563.84 |
|    Id2335   | 27.36  |  563.84 |
|    Id2335   | 27.28  |  563.84 |
|    Id2335   | 25.71  |  563.84 |
|    Id2335   | 27.79  |  563.84 |
|    Id2335   | 32.06  |  563.84 |
|    Id2335   | 32.54  |  563.84 |
|    Id2335   | 30.86  |  563.84 |
+-------------+--------+---------+
Truncated to displaylimit of 10.

## Task 8: Patients with Major Surgeries or Cancer History
In this project, we retrieve the names of customers who have had at least two major surgeries or have a history of cancer, as recorded in the medical_examinations table. This analysis helps identify patients with complex medical histories, enabling healthcare providers to tailor care plans and assess potential healthcare costs for these individuals.

In [107]:
%%sql
select name
from names as n
inner join medical_examinations as me
on n.customer_id = me.customer_id
where number_of_major_surgeries > 1
or cancer_hist = "yes"

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

687 rows affected.

+----------------------------------+
|               name               |
+----------------------------------+
|          Lu, Mr.  Phil           |
|      Hallman, Mr.  Stephen       |
|      Moran, Mr.  Patrick R.      |
| Fierro Vargas, Ms.  Paola Andrea |
|      Rios, Ms.  Leilani M.       |
|     Cronin, Ms.  Jennifer A.     |
|   Noordstar, Ms.  Christina M.   |
|        Fennon, Mr.  Myles        |
|      Hribar, Ms.  Madelyn C      |
|      Tassello, Ms.  Nicole       |
+----------------------------------+
Truncated to displaylimit of 10.

## Task 9: Customer with Most Major SurgeriesÂ¶
In this project, we identify and display the customer with the highest number of major surgeries. By joining the names and medical_examinations tables and sorting the records by the number of major surgeries in descending order, we can pinpoint the customer with the most significant surgical history. This insight is valuable for personalized healthcare management and resource allocation.

In [116]:
%%sql
select n.customer_id,name,number_of_major_surgeries
from names as n 
inner join medical_examinations as me
on n.customer_id = me.customer_id 
and number_of_major_surgeries != "No major surgery"
order by number_of_major_surgeries desc

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

1261 rows affected.

+-------------+--------------------------+---------------------------+
| customer_id |           name           | number_of_major_surgeries |
+-------------+--------------------------+---------------------------+
|    Id696    |    Power, Mr.  Rich M    |             3             |
|     Id8     |  Hallman, Mr.  Stephen   |             3             |
|    Id665    |  Heitzman, Ms.  Ariel E  |             3             |
|    Id713    |    Boyce, Mr.  Albert    |             3             |
|    Id697    |   Routon, Mr.  Aaron C   |             3             |
|     Id17    | Cronin, Ms.  Jennifer A. |             3             |
|    Id705    |  Delong, Ms.  Candace N  |             3             |
|    Id674    |   Gayagoy, Ms.  Kristi   |             3             |
|    Id695    |   Looi, Mr.  Alexander   |             3             |
|    Id738    | Berger, Mr.  Bruce A Jr. |             3             |
+-------------+--------------------------+---------------------------+
Truncated to displaylimit of 10.

## Task 10: Customers with Major Surgeries and City Tiers
In this project, we compile a list of customers who have undergone major surgeries and their respective cities' tier levels (city_tier) from the hospitalization_details table. This analysis provides insights into the distribution of major surgeries across different city tiers, aiding in healthcare planning, resource allocation, and assessing the impact of city tiers on surgical cases

In [122]:
%%sql
select hd.customer_id,city_tier,name
from hospitalisation_details as hd
inner join medical_examinations as me
inner join names as n
on hd.customer_id = me.customer_id
and n.customer_id = hd.customer_id
where number_of_major_surgeries > 0

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

1261 rows affected.

+-------------+-----------+------------------------------------+
| customer_id | city_tier |                name                |
+-------------+-----------+------------------------------------+
|    Id2335   |  tier - 3 |        German, Mr.  Aaron K        |
|    Id2334   |  tier - 1 |       Rosendahl, Mr.  Evan P       |
|    Id2333   |  tier - 1 |         Albano, Ms.  Julie         |
|    Id2332   |  tier - 3 | Riveros Gonzalez, Mr.  Juan D. Sr. |
|    Id2331   |  tier - 3 |       Brietzke, Mr.  Jordan        |
|    Id2329   |  tier - 3 |       Bohinski, Ms.  Susan E       |
|    Id2328   |  tier - 3 |         Avery, Ms.  Nicole         |
|    Id2326   |  tier - 3 |       Castro, Mr.  Sebastian       |
|    Id2321   |  tier - 1 |       Danielson, Mr.  Thomas       |
|    Id2319   |  tier - 3 |    Petermann, Mr.  Theodore A.     |
+-------------+-----------+------------------------------------+
Truncated to displaylimit of 10.

## Task 11: Average BMI by City Tier in 1995
This project aims to calculate the average BMI for each city tier level in the year 1995 from the hospitalization_details table. Analyzing the average BMI across different city tiers allows us to understand the variations in health parameters among urban areas. It provides insights that can be used for health planning, resource allocation, and identifying potential health trends.

In [127]:
%%sql
select round(avg(BMI),2) as avg_bmi,city_tier
from medical_examinations as me
inner join hospitalisation_details as hd
on me.customer_id = hd.customer_id
where year = "1995"
group by city_tier

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

3 rows affected.

+---------+-----------+
| avg_bmi | city_tier |
+---------+-----------+
|  30.69  |  tier - 3 |
|  29.43  |  tier - 2 |
|  29.82  |  tier - 1 |
+---------+-----------+

## Task 12: High BMI Customers with Health Issues
In this project, we extract customer IDs, names, and charges of customers who have health issues and a BMI greater than 30. By combining data from the names, medical_examinations, and hospitalization_details tables, we can identify individuals with specific health concerns and high BMI levels. This information is valuable for targeted healthcare interventions and assessing associated healthcare costs.

In [132]:
%%sql
select hd.customer_id,name,charges
from hospitalisation_details as hd
inner join medical_examinations as me
inner join names as n
on hd.customer_id = me.customer_id
and n.customer_id = hd.customer_id
where health_issues = "yes" and
BMI > 30

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

488 rows affected.

+-------------+-------------------------+---------+
| customer_id |           name          | charges |
+-------------+-------------------------+---------+
|    Id2223   |   Young, Mr.  Zachary   | 1526.31 |
|    Id2222   | Lawder, Mr.  Matthew T. | 1532.47 |
|    Id2221   |  Sanseverino, Mr.  Cole |  1534.3 |
|    Id2155   |  Waters, Mr.  Brian W.  | 1909.53 |
|    Id2154   |   Lutz, Mr.  Zachary A  | 1917.32 |
|    Id2143   |    Deiman, Ms.  Lena    | 2020.18 |
|    Id2142   |     Putt, Ms.  Tammy    | 2020.55 |
|    Id2141   | De Hueck, Ms.  Jennifer | 2026.97 |
|    Id2139   |   Gamirov, Mr.  Arthur  | 2055.32 |
|    Id2102   |    Goetz, Mr.  Justin   |  2254.8 |
+-------------+-------------------------+---------+
Truncated to displaylimit of 10.

## Task 13: Customers with Highest Charges and City Tier by Year
In this project, we identify the customer with the highest total charges for each year and display their corresponding city_tier. By joining the hospitalization_details and names tables and grouping the data by year, customer name, and city_tier, we can determine which customer incurred the highest charges in each year. This analysis is crucial for understanding cost patterns over time and tailoring healthcare strategies accordingly.

In [153]:
%%sql
select 
name,year,city_tier, max(charges) as total_charges
from hospitalisation_details as hd
inner join names as n
on hd.customer_id = n.customer_id
group by year,name,city_tier

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

2335 rows affected.

+------------------------------------+------+-----------+---------------+
|                name                | year | city_tier | total_charges |
+------------------------------------+------+-----------+---------------+
|        German, Mr.  Aaron K        | 1992 |  tier - 3 |     563.84    |
|       Rosendahl, Mr.  Evan P       | 1992 |  tier - 1 |     570.62    |
|         Albano, Ms.  Julie         | 1993 |  tier - 1 |     600.0     |
| Riveros Gonzalez, Mr.  Juan D. Sr. | 1992 |  tier - 3 |     604.54    |
|       Brietzke, Mr.  Jordan        | 1998 |  tier - 3 |     637.26    |
|          Kohls, Ms.  Katy          | 2001 |  tier - 3 |     646.14    |
|       Bohinski, Ms.  Susan E       | 1993 |  tier - 3 |     650.0     |
|         Avery, Ms.  Nicole         | 1995 |  tier - 3 |     650.0     |
|         Howell, Ms.  Laura         | 2002 |  tier - 2 |     668.0     |
|       Castro, Mr.  Sebastian       | 1997 |  tier - 3 |     670.0     |
+------------------------------------+------+-----------+---------------+
Truncated to displaylimit of 10.

## Task 14: Top 3 Customers with Highest Average Yearly Charges
This project focuses on identifying the top 3 customers with the highest average yearly charges over the years they have been hospitalized. By calculating and analyzing the average yearly charges from the hospitalization_details data and joining it with customer names, we can pinpoint those individuals with the highest healthcare expenditure. Understanding these patterns is essential for resource allocation and tailored healthcare planning.

In [174]:
%%sql
with yearly_charges (avg_charges,year,customer_id) as (
    select round(avg(charges),2),year,customer_id
from hospitalisation_details as hd
group by year,customer_id
    order by 1 desc
)
# select * from yearly_charges
select name , max(avg_charges) 
from yearly_charges as yc
inner join names as n
on yc.customer_id = n.customer_id
group by name
limit 5

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

5 rows affected.

+------------------------+------------------+
|          name          | max(avg_charges) |
+------------------------+------------------+
|   Hawks, Ms.  Kelly    |     63770.43     |
| Lehner, Mr.  Matthew D |     62592.87     |
|     Lu, Mr.  Phil      |     60021.4      |
|  Osborne, Ms.  Kelsey  |     58571.07     |
|  Kadala, Ms.  Kristyn  |     55135.4      |
+------------------------+------------------+

## Task 15: Ranking Customers by Total ChargesÂ¶
This analysis aims to rank customers based on their total charges over the years in descending order. By summing up the charges from the hospitalization_details data for each customer and assigning a rank, we can identify those with the highest healthcare expenses. This information is valuable for healthcare providers and policymakers in tailoring services and managing resources effectively.

In [178]:
%%sql
select name,sum(charges) as total_charges,
rank() over(order by sum(charges) desc) as charges_rank
from hospitalisation_details as hd
inner join names as n
on hd.customer_id = n.customer_id
group by name

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

2335 rows affected.

+------------------------+---------------+--------------+
|          name          | total_charges | charges_rank |
+------------------------+---------------+--------------+
|   Hawks, Ms.  Kelly    |    63770.43   |      1       |
| Lehner, Mr.  Matthew D |    62592.87   |      2       |
|     Lu, Mr.  Phil      |    60021.4    |      3       |
|  Osborne, Ms.  Kelsey  |    58571.07   |      4       |
|  Kadala, Ms.  Kristyn  |    55135.4    |      5       |
| Baker, Mr.  Russell B. |    52590.83   |      6       |
| Macpherson, Mr.  Scott |    51194.56   |      7       |
| Hallman, Mr.  Stephen  |    49577.66   |      8       |
| Moran, Mr.  Patrick R. |    48970.25   |      9       |
| Benner, Ms.  Brooke N. |    48885.14   |      10      |
+------------------------+---------------+--------------+
Truncated to displaylimit of 10.

## Task 16: Identifying Peak Year for Hospitalizations
This task is essential for identifying the year with the highest number of hospitalizations. By calculating the count of hospitalizations for each year from the hospitalization_details dataset, we can pinpoint the peak year for healthcare demand. This insight can help healthcare institutions allocate resources and plan for peak demand years more effectively.

In [182]:
%%sql
with yearly_hospitalization (count_of_hospitalisation,year) as  (
    select count(*) as count_of_hospitalisation, year
    from hospitalisation_details
    group by year
    order by 1 desc)
select * from yearly_hospitalization

Running query in 'mysql+pymysql://root:***@localhost/hospital_data'

47 rows affected.

+--------------------------+------+
| count_of_hospitalisation | year |
+--------------------------+------+
|           100            | 2004 |
|            85            | 2003 |
|            60            | 1988 |
|            60            | 1972 |
|            57            | 1970 |
|            57            | 1975 |
|            57            | 1974 |
|            56            | 1992 |
|            55            | 1976 |
|            55            | 2002 |
+--------------------------+------+
Truncated to displaylimit of 10.